---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsForHooksEnabled
source: html/d6b22a1a-d86b-1c8d-99c2-f767f069bb6c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsForHooksEnabled Property

"Hook Lengths"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsForHooksEnabled { get; }
```